ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://karpov.courses/simulator-sql

<b>Задача 1</b>

Выведите все записи из таблицы products.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p

<b>Задача 2</b>

Выведите все записи из таблицы products, отсортировав их по наименованиям товаров в алфавитном порядке, т.е. по возрастанию.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p
ORDER BY p.name

<b>Задача 3</b>

Отсортируйте таблицу courier_actions сначала по колонке courier_id по возрастанию id курьера, потом по колонке action, а затем по колонке time, но уже по убыванию — от самого последнего действия к самому первому.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: courier_id, order_id, action, time

In [ ]:
SELECT *
FROM courier_actions as ca
ORDER BY ca.courier_id, ca.action, ca.time DESC
LIMIT 1000

<b>Задача 4</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, определите 5 самых дорогих товаров в таблице products, которые доставляет наш сервис. Выведите их наименования и цену.

Поля в результирующей таблице: name, price

In [ ]:
SELECT p.name, p.price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 5</b>

Повторите запрос из предыдущего задания, но теперь колонки name и price переименуйте соответственно в product_name и product_price.

Поля в результирующей таблице: product_name, product_price

In [ ]:
SELECT p.name as product_name, p.price as product_price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 6</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, а также функцию LENGTH, определите товар с самым длинным названием в таблице products. Выведите его наименование, длину наименования в символах, а также цену этого товара. Колонку с длиной наименования в символах назовите name_length.

Поля в результирующей таблице: name, name_length, price

In [ ]:
SELECT p.name,
       length(p.name) as name_length,
       p.price
FROM products as p
ORDER BY 2 desc
LIMIT 1

<b>Задача 7</b>

Примените последовательно функции UPPER и SPLIT_PART к колонке name и преобразуйте наименования товаров в таблице products так, чтобы от названий осталось только первое слово, записанное в верхнем регистре. Колонку с новым названием, состоящим из первого слова, назовите first_word.

В результат включите исходные наименования товаров, новые наименования из первого слова, а также цену товаров. Результат отсортируйте по возрастанию исходного наименования товара в колонке name.

Поля в результирующей таблице: name, first_word, price

In [ ]:
SELECT p.name,
       UPPER(SPLIT_PART(p.name, ' ', 1)) as first_word,
       p.price
FROM products as p
ORDER BY p.name

<b>Задача 8</b>

Измените тип колонки price из таблицы products на VARCHAR. Выведите колонки с наименованием товаров, ценой в исходном формате и ценой в формате VARCHAR. Новую колонку с ценой в новом формате назовите price_char.

Результат отсортируйте по возрастанию исходного наименования товара в колонке name. Количество выводимых записей не ограничивайте.

Поле в результирующей таблице: name, price, price_char

In [ ]:
SELECT p.name,
       p.price,
       p.price::VARCHAR as price_char
FROM products as p
ORDER BY p.name

<b>Задача 9</b>

Для первых 200 записей из таблицы orders выведите информацию в следующем виде (обратите внимание на пробелы):

Заказ № [id_заказа] создан [дата]

Полученную колонку назовите order_info.

In [ ]:
SELECT CONCAT('Заказ № ', o.order_id, ' создан ', o.creation_time::DATE) as order_info
FROM orders as o
LIMIT 200

<b>Задача 10</b>

Выведите id всех курьеров и их годы рождения из таблицы couriers.

Год рождения необходимо получить из колонки birth_date. Новую колонку с годом назовите birth_year. Результат отсортируйте сначала по убыванию года рождения курьера (т.е. от самых младших к самым старшим), затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       DATE_PART('YEAR', c.birth_date) as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 11</b>

Как и в предыдущем задании, снова выведите id всех курьеров и их годы рождения, только теперь к извлеченному году примените функцию COALESCE. Укажите параметры функции так, чтобы вместо NULL значений в результат попадало текстовое значение unknown. Названия полей оставьте прежними.

Отсортируйте итоговую таблицу сначала по убыванию года рождения курьера, затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       COALESCE(DATE_PART('YEAR', c.birth_date)::varchar, 'unknown') as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 12</b>

Давайте представим, что по какой-то необъяснимой причине мы вдруг решили в одночасье повысить цену всех товаров в таблице products на 5%.

Выведите id и наименования всех товаров, их старую и новую цену. Колонку со старой ценой назовите old_price, а колонку с новой — new_price.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       p.price * 1.05 as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 13</b>

Вновь, как и в прошлом задании, повысьте цену всех товаров на 5%, только теперь к колонке с новой ценой примените функцию ROUND. Выведите id и наименования товаров, их старую цену, а также новую цену с округлением. Новую цену округлите до одного знака после запятой, но тип данных не меняйте.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       ROUND(p.price * 1.05, 1) as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 14</b>

Повысьте цену на 5% только на те товары, цена которых превышает 100 рублей. Цену остальных товаров оставьте без изменений. Также не повышайте цену на икру, которая и так стоит 800 рублей. Выведите id и наименования всех товаров, их старую и новую цену. Цену округлять не нужно.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       CASE
       WHEN p.price > 100 AND p.name != 'икра' THEN p.price * 1.05
       ELSE p.price END as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 15</b>

Вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.

Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       ROUND(p.price / 120 * 20, 2) as tax,
       ROUND(p.price - p.price / 120 * 20, 2) as price_before_tax
FROM products as p
ORDER BY 5 DESC, 1

<b>Задача 16</b>

Напишите SQL-запрос к таблице products и выведите всю информацию о товарах, цена которых не превышает 100 рублей. Результат отсортируйте по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price
FROM products as p
WHERE p.price <= 100
ORDER BY 1

<b>Задача 17</b>

Отберите пользователей женского пола из таблицы users. Выведите только id этих пользователей. Результат отсортируйте по возрастанию id.

Добавьте в запрос оператор LIMIT и выведите только 1000 первых id из отсортированного списка.

Поле в результирующей таблице: user_id

In [ ]:
SELECT u.user_id
FROM users as u
WHERE sex = 'female'
ORDER BY 1
LIMIT 1000

<b>Задача 18</b>

Отберите из таблицы user_actions все действия пользователей по созданию заказов, которые были совершены ими после полуночи 6 сентября 2022 года. Выведите колонки с id пользователей, id созданных заказов и временем их создания.

Результат должен быть отсортирован по возрастанию id заказа.

Поля в результирующей таблице: user_id, order_id, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.time
FROM user_actions as ua
WHERE ua.action = 'create_order'
AND ua.time >= '2022-09-06'
ORDER BY ua.order_id

<b>Задача 19</b>

Назначьте скидку 20% на все товары из таблицы products и отберите те, цена на которые с учётом скидки превышает 100 рублей. Выведите id товаров, их наименования, прежнюю цену и новую цену с учётом скидки. <br>Колонку со старой ценой назовите old_price, с новой — new_price.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
      (p.price * 0.8) as new_price
FROM products as p
WHERE p.price * 0.8 > 100
ORDER BY 1

<b>Задача 20</b>

Отберите из таблицы products все товары, названия которых либо начинаются со слова «чай», либо состоят из пяти символов. Выведите две колонки: id товаров и их наименования.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE SPLIT_PART(p.name,' ', 1) = 'чай'
OR LENGTH(p.name) = 5
ORDER BY 1

<b>Задача 21</b>

Отберите из таблицы products все товары, содержащие в своём названии последовательность символов «чай» (без кавычек). Выведите две колонки: id продукта и его название.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE p.name LIKE '%чай%'
ORDER BY 1

<b>Задача 22</b>

Выберите из таблицы products id и наименования только тех товаров, названия которых начинаются на букву «с» и содержат только одно слово.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE p.name LIKE 'с%'
AND p.name NOT LIKE '% %'
ORDER BY 1

<b>Задача 23</b>

Составьте SQL-запрос, который выбирает из таблицы products все чаи стоимостью больше 60 рублей и вычисляет для них цену со скидкой 25%.

Скидку в % менеджер попросил указать в отдельном столбце в формате текста, то есть вот так: «25%» (без кавычек). Столбцы со скидкой и новой ценой назовите соответственно discount и new_price.

Также необходимо любым известным способом избавиться от «чайного гриба»: вряд ли менеджер имел в виду и его, когда ставил нам задачу.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, discount, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       '25%' as discount,
       p.price * 0.75 as new_price
FROM products as p
WHERE p.price > 60
AND SPLIT_PART(p.name, ' ', 1) = 'чай'
ORDER BY 1

<b>Задача 24</b>

Из таблицы user_actions выведите всю информацию о действиях пользователей с id 170, 200 и 230 за период с 25 августа по 4 сентября 2022 года включительно. Результат отсортируйте по убыванию id заказа — то есть от самых поздних действий к самым первым.

Поля в результирующей таблице: user_id, order_id, action, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.action,
       ua.time
FROM user_actions as ua
WHERE ua.user_id IN (170, 200, 230)
AND ua.time BETWEEN '2022-08-25' AND '2022-09-05'
ORDER BY 2 DESC

<b>Задача 25</b>

Напишите SQL-запрос к таблице couriers и выведите всю информацию о курьерах, у которых не указан их день рождения.

Результат должен быть отсортирован по возрастанию id курьера.

Поля в результирующей таблице: birth_date, courier_id, sex

In [ ]:
SELECT c.birth_date,
       c.courier_id,
       c.sex
FROM couriers as c
WHERE c.birth_date IS NULL
ORDER BY 2

<b>Задача 26</b>

Определите id и даты рождения 50 самых молодых пользователей мужского пола из таблицы users. Не учитывайте тех пользователей, у которых не указана дата рождения.

Поле в результирующей таблице: user_id, birth_date

In [ ]:
SELECT u.user_id,
       u.birth_date
FROM users as u
WHERE u.birth_date IS NOT NULL
AND u.sex = 'male'
ORDER BY u.birth_date DESC
LIMIT 50;

<b>Задача 27</b>

Напишите SQL-запрос к таблице courier_actions, чтобы узнать id и время доставки последних 10 заказов, доставленных курьером с id 100.

Поля в результирующей таблице: order_id, time

In [ ]:
SELECT ca.order_id,
       ca.time
FROM courier_actions as ca
WHERE ca.courier_id = 100
AND ca.action = 'deliver_order'
ORDER BY 2 DESC
LIMIT 10;

<b>Задача 28</b>

Из таблицы user_actions получите id всех заказов, сделанных пользователями сервиса в августе 2022 года.

Результат отсортируйте по возрастанию id заказа.

Поле в результирующей таблице: order_id

In [ ]:
SELECT ua.order_id
FROM user_actions as ua
WHERE DATE_PART('year', ua.time) = 2022
AND DATE_PART('month', ua.time) = 8
AND ua.action = 'create_order'
ORDER BY 1;

<b>Задача 29</b>

Из таблицы couriers отберите id всех курьеров, родившихся в период с 1990 по 1995 год включительно.

Результат отсортируйте по возрастанию id курьера.

Поле в результирующей таблице: courier_id

In [ ]:
SELECT c.courier_id
FROM couriers as c
WHERE DATE_PART('year', c.birth_date) BETWEEN 1990 AND 1995
ORDER BY 1;

<b>Задача 30</b>

Из таблицы user_actions получите информацию о всех отменах заказов, которые пользователи совершали в течение августа 2022 года по средам с 12:00 до 15:59.

Результат отсортируйте по убыванию id отменённых заказов.

Поля в результирующей таблице: user_id, order_id, action, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.action,
       ua.time
FROM user_actions as ua
WHERE ua.action = 'cancel_order'
AND DATE_PART('year', ua.time) = 2022
AND DATE_PART('month', ua.time) = 8
AND DATE_PART('dow', ua.time) = 3
AND DATE_PART('hour', ua.time) BETWEEN 12 AND 15
AND DATE_PART('minute', ua.time) BETWEEN 0 AND 59
ORDER BY 2 DESC;

<b>Задача 31</b>

Как и в задаче из прошлого урока, вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Однако теперь примите во внимание, что для товаров из списка налог составляет 10%. Для остальных товаров НДС тот же — 20%.

Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.

Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       CASE WHEN p.name IN ('сахар', 'сухарики', 'сушки',
                            'семечки', 'масло льняное', 'виноград',
                            'масло оливковое', 'арбуз', 'батон', 'йогурт',
                            'сливки', 'гречка', 'овсянка', 'макароны',
                            'баранина', 'апельсины', 'бублики', 'хлеб',
                            'горох', 'сметана', 'рыба копченая', 'мука',
                            'шпроты', 'сосиски', 'свинина', 'рис', 'масло кунжутное',
                            'сгущенка', 'ананас', 'говядина', 'соль', 'рыба вяленая',
                            'масло подсолнечное', 'яблоки', 'груши', 'лепешка', 'молоко',
                            'курица', 'лаваш', 'вафли', 'мандарины')
       THEN ROUND(p.price / 110 * 10, 2)
       ELSE ROUND(p.price / 120 * 20, 2) END as tax,
       CASE WHEN p.name in ('сахар', 'сухарики', 'сушки',
                            'семечки', 'масло льняное', 'виноград',
                            'масло оливковое', 'арбуз', 'батон', 'йогурт',
                            'сливки', 'гречка', 'овсянка', 'макароны',
                            'баранина', 'апельсины', 'бублики', 'хлеб',
                            'горох', 'сметана', 'рыба копченая', 'мука',
                            'шпроты', 'сосиски', 'свинина', 'рис', 'масло кунжутное',
                            'сгущенка', 'ананас', 'говядина', 'соль', 'рыба вяленая',
                            'масло подсолнечное', 'яблоки', 'груши', 'лепешка', 'молоко',
                            'курица', 'лаваш', 'вафли', 'мандарины')
       THEN ROUND(p.price - p.price / 110 * 10, 2)
       ELSE ROUND(p.price - p.price / 120 * 20, 2) END as price_before_tax
FROM products as p
ORDER BY 5 desc, 1;

<b>Задача 32</b>

Выведите id всех уникальных пользователей из таблицы user_actions. Результат отсортируйте по возрастанию id.

Поле в результирующей таблице: user_id

In [ ]:
SELECT DISTINCT ua.user_id
FROM user_actions as ua
ORDER BY 1;

<b>Задача 33</b>

Примените DISTINCT сразу к двум колонкам таблицы courier_actions и отберите уникальные пары значений courier_id и order_id.

Результат отсортируйте сначала по возрастанию id курьера, затем по возрастанию id заказа.

Поля в результирующей таблице: courier_id, order_id

In [ ]:
SELECT DISTINCT ca.courier_id,
                ca.order_id
FROM courier_actions as ca
ORDER BY 1, 2;

<b>Задача 34</b>

Посчитайте максимальную и минимальную цены товаров в таблице products. Поля назовите соответственно max_price, min_price.

Поля в результирующей таблице: max_price, min_price

In [ ]:
SELECT MAX(p.price) as max_price,
       MIN(p.price) as min_price
FROM products as p;

<b>Задача 35</b>

Как вы помните, в таблице users у некоторых пользователей не были указаны их даты рождения.

Посчитайте в одном запросе количество всех записей в таблице и количество только тех записей, для которых в колонке birth_date указана дата рождения.

Колонку с общим числом записей назовите dates, а колонку с записями без пропусков — dates_not_null.

Поля в результирующей таблице: dates, dates_not_null

In [ ]:
SELECT COUNT(*) as dates,
       COUNT(u.birth_date) as dates_not_null
FROM users as u;

<b>Задача 36</b>

Посчитайте количество всех значений в колонке user_id в таблице user_actions, а также количество уникальных значений в этой колонке (т.е. количество уникальных пользователей сервиса).

Колонку с первым полученным значением назовите users, а колонку со вторым — unique_users.

Поля в результирующей таблице: users, unique_users

In [ ]:
SELECT COUNT(ua.user_id) as users,
       COUNT(DISTINCT ua.user_id) as unique_users
FROM user_actions as ua;

<b>Задача 37</b>

Посчитайте количество курьеров женского пола в таблице couriers. Полученный столбец с одним значением назовите couriers.

Поле в результирующей таблице: couriers

In [ ]:
SELECT COUNT(c.courier_id) as couriers
FROM couriers as c
WHERE c.sex = 'female'

<b>Задача 38</b>

Рассчитайте время, когда были совершены первая и последняя доставки заказов в таблице courier_actions.

Колонку с временем первой доставки назовите first_delivery, а колонку с временем последней — last_delivery.

Поля в результирующей таблице: first_delivery, last_delivery

In [ ]:
SELECT MIN(ca.time) as first_delivery,
       MAX(ca.time) as last_delivery
FROM courier_actions as ca
WHERE ca.action = 'deliver_order'

<b>Задача 39</b>

Представьте, что один из пользователей сервиса сделал заказ, в который вошли одна пачка сухариков, одна пачка чипсов и один энергетический напиток. Посчитайте стоимость такого заказа.

Колонку с рассчитанной стоимостью заказа назовите order_price.

Для расчётов используйте таблицу products.

Поле в результирующей таблице: order_price

In [ ]:
SELECT SUM(p.price) as order_price
FROM products as p
WHERE p.name IN ('сухарики', 'чипсы', 'энергетический напиток')

<b>Задача 40</b>

Посчитайте количество заказов в таблице orders с девятью и более товарами. Для этого воспользуйтесь функцией array_length, отфильтруйте данные по количеству товаров в заказе и проведите агрегацию. Полученный столбец назовите orders.

Поле в результирующей таблице: orders

In [ ]:
SELECT COUNT(o.order_id) as orders
FROM orders as o
WHERE ARRAY_LENGTH(o.product_ids, 1) >= 9

<b>Задача 41</b>

С помощью функции AGE и агрегирующей функции рассчитайте возраст самого молодого курьера мужского пола в таблице couriers.

Возраст выразите количеством лет, месяцев и дней (как в примере выше), переведя его в тип VARCHAR.

В качестве даты, относительно которой считать возраст курьеров, используйте свою текущую дату (либо не указывайте её на месте первого аргумента, как показано в примерах).

Полученную колонку со значением возраста назовите min_age.

Поле в результирующей таблице: min_age

In [ ]:
SELECT MIN(AGE(current_date, c.birth_date))::VARCHAR as min_age
FROM couriers as c
WHERE c.sex = 'male'

<b>Задача 42</b>

Посчитайте стоимость заказа, в котором будут три пачки сухариков, две пачки чипсов и один энергетический напиток.<br> Колонку с рассчитанной стоимостью заказа назовите order_price.

Для расчётов используйте таблицу products.

Поле в результирующей таблице: order_price

In [ ]:
SELECT SUM(CASE WHEN p.name = 'сухарики' THEN p.price * 3
                WHEN p.name = 'чипсы' THEN p.price * 2
                WHEN p.name = 'энергетический напиток' THEN p.price * 1
                else 0 end) as order_price
FROM products as p

<b>Задача 43</b>

Рассчитайте среднюю цену товаров в таблице products, в названиях которых присутствуют слова «чай» или «кофе». <br>Любым известным способом исключите из расчёта товары содержащие «иван-чай» или «чайный гриб».

Среднюю цену округлите до двух знаков после запятой. Столбец с полученным значением назовите avg_price.

Поле в результирующей таблице: avg_price

In [ ]:
SELECT ROUND(AVG(p.price), 2) as avg_price
FROM products as p
WHERE (p.name LIKE '%чай%'
OR p.name LIKE '%кофе%')
AND (p.name NOT LIKE '%иван-чай%'
AND p.name NOT LIKE '%чайный гриб%')

<b>Задача 44</b>

Воспользуйтесь функцией AGE и рассчитайте разницу в возрасте между самым старым и самым молодым пользователями мужского пола в таблице users.

Разницу в возрасте выразите количеством лет, месяцев и дней, переведя её в тип VARCHAR.

Колонку с посчитанным значением назовите age_diff.

Поле в результирующей таблице: age_diff

In [ ]:
SELECT AGE(MAX(u.birth_date),MIN(u.birth_date))::VARCHAR as age_diff
FROM users as u
WHERE u.sex = 'male'

<b>Задача 45</b>

Рассчитайте среднее количество товаров в заказах из таблицы orders, которые пользователи оформляли по выходным дням (суббота и воскресенье) в течение всего времени работы сервиса.

Полученное значение округлите до двух знаков после запятой. Колонку с ним назовите avg_order_size.

Поле в результирующей таблице: avg_order_size

In [ ]:
SELECT ROUND(AVG(ARRAY_LENGTH(o.product_ids, 1)), 2) as avg_order_size
FROM orders as o
WHERE DATE_PART('dow', o.creation_time) IN (6, 0)

<b>Задача 46</b>

На основе данных в таблице user_actions посчитайте количество уникальных пользователей сервиса, количество уникальных заказов, поделите одно на другое и выясните, сколько заказов приходится на одного пользователя.

В результирующей таблице отразите все три значения — поля назовите соответственно unique_users, unique_orders, orders_per_user.

Показатель числа заказов на пользователя округлите до двух знаков после запятой.

Поля в результирующей таблице: unique_users, unique_orders, orders_per_user

In [ ]:
SELECT COUNT(DISTINCT ua.user_id) as unique_users,
       COUNT(DISTINCT ua.order_id) as unique_orders,
       ROUND(COUNT(DISTINCT ua.order_id)::DECIMAL / COUNT(DISTINCT ua.user_id),
             2) as orders_per_user
FROM user_actions as ua

<b>Задача 47</b>

Посчитайте, сколько пользователей никогда не отменяли свой заказ. Для этого из общего числа всех уникальных пользователей отнимите число уникальных пользователей, которые хотя бы раз отменяли заказ. Подумайте, какое условие необходимо указать в FILTER, чтобы получить корректный результат.

Полученный столбец назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
SELECT COUNT(DISTINCT ua.user_id) - COUNT(DISTINCT ua.user_id) FILTER (WHERE ua.action = 'cancel_order') as users_count
FROM user_actions as ua

<b>Задача 48</b>

Посчитайте общее количество заказов в таблице orders, количество заказов с пятью и более товарами и найдите долю заказов с пятью и более товарами в общем количестве заказов.

В результирующей таблице отразите все три значения — поля назовите соответственно orders, large_orders, large_orders_share.

Долю заказов с пятью и более товарами в общем количестве товаров округлите до двух знаков после запятой.

Поля в результирующей таблице: orders, large_orders, large_orders_share

In [ ]:
SELECT COUNT(o.order_id) as orders,
       COUNT(o.order_id)  FILTER (WHERE ARRAY_LENGTH(product_ids, 1) >= 5) as large_orders,
       ROUND(COUNT(o.order_id) FILTER (WHERE ARRAY_LENGTH(product_ids, 1) >= 5)::DECIMAL / COUNT(o.order_id),
             2) as large_orders_share
FROM orders as o

<b>Задача 49</b>

С помощью оператора GROUP BY посчитайте количество курьеров мужского и женского пола в таблице couriers.

Новую колонку с числом курьеров назовите couriers_count.

Результат отсортируйте по этой колонке по возрастанию.

Поля в результирующей таблице: sex, couriers_count

In [ ]:
SELECT c.sex,
       COUNT(*) as couriers_count
FROM couriers as c
GROUP BY 1
ORDER BY 2

<b>Задача 50</b>

Посчитайте количество созданных и отменённых заказов в таблице user_actions.

Новую колонку с числом заказов назовите orders_count.

Результат отсортируйте по числу заказов по возрастанию.

Поля в результирующей таблице: action, orders_count

In [ ]:
SELECT ua.action,
       COUNT(*) as orders_count
FROM user_actions as ua
GROUP BY 1
ORDER BY 2

<b>Задача 51</b>

Используя группировку и функцию DATE_TRUNC, приведите все даты к началу месяца и посчитайте, <br>сколько заказов было сделано в каждом из них.

Расчёты проведите по таблице orders. Колонку с усечённой датой назовите month, колонку с количеством заказов — orders_count.

Результат отсортируйте по месяцам — по возрастанию.

Поля в результирующей таблице: month, orders_count

In [ ]:
SELECT DATE_TRUNC('month', o.creation_time) as month,
       COUNT(*) as orders_count
FROM orders as o
GROUP BY 1
ORDER BY 2

<b>Задача 52</b>

Используя группировку и функцию DATE_TRUNC, приведите все даты к началу месяца и посчитайте, <br>сколько заказов было сделано и сколько было отменено в каждом из них.

В этот раз расчёты проведите по таблице user_actions. <br>Колонку с усечённой датой назовите month, колонку с количеством заказов — orders_count.

Результат отсортируйте сначала по месяцам — по возрастанию, затем по типу действия — тоже по возрастанию.

Поля в результирующей таблице: month, action, orders_count

In [ ]:
SELECT DATE_TRUNC('month', ua.time) as month,
       ua.action,
       COUNT(*) as orders_count
FROM user_actions as ua
GROUP BY 1, 2
ORDER BY 1, 2

<b>Задача 53</b>

По данным в таблице users посчитайте максимальный порядковый номер месяца среди всех порядковых номеров месяцев рождения пользователей сервиса. С помощью группировки проведите расчёты отдельно в двух группах — для пользователей мужского и женского пола.

Новую колонку с максимальным номером месяца рождения в группах назовите max_month. Преобразуйте значения в новой колонке в формат INTEGER, чтобы порядковый номер был выражен целым числом.

Результат отсортируйте по колонке с полом пользователей.

Поля в результирующей таблице: sex, max_month

In [ ]:
SELECT u.sex,
       MAX(DATE_PART('month', u.birth_date))::integer as max_month
FROM users as u
GROUP BY 1
ORDER BY 1

<b>Задача 54</b>

По данным в таблице users посчитайте порядковый номер месяца рождения самого молодого пользователя сервиса. С помощью группировки проведите расчёты отдельно в двух группах — для пользователей мужского и женского пола.

Новую колонку с максимальным номером месяца рождения в группах назовите max_month. Преобразуйте значения в новой колонке в формат INTEGER, чтобы порядковый номер был выражен целым числом.

Результат отсортируйте по колонке с полом пользователей.

Поля в результирующей таблице: sex, max_month

In [ ]:
SELECT u.sex,
       DATE_PART('month', max(u.birth_date))::integer as max_month
FROM users as u
GROUP BY 1
ORDER BY 1

<b>Задача 55</b>

Посчитайте максимальный возраст пользователей мужского и женского пола в таблице users. Возраст измерьте числом полных лет.

Новую колонку с возрастом назовите max_age. Преобразуйте значения в новой колонке в формат INTEGER, чтобы возраст был выражен целым числом.

Результат отсортируйте по новой колонке по возрастанию возраста.

Поля в результирующей таблице: sex, max_age

In [ ]:
SELECT u.sex,
       DATE_PART('year', MAX(AGE(current_date, u.birth_date)))::integer as max_age
FROM users as u
GROUP BY 1
ORDER BY 2

<b>Задача 56</b>

Разбейте пользователей из таблицы users на группы по возрасту (возраст по-прежнему измеряем числом полных лет) и посчитайте количество пользователей каждого возраста.

Колонку с возрастом назовите age, а колонку с числом пользователей — users_count. Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст был выражен целым числом.

Результат отсортируйте по колонке с возрастом по возрастанию.

Поля в результирующей таблице: age, users_count

In [ ]:
SELECT DATE_PART('year', AGE(current_date, u.birth_date))::integer as age,
       COUNT(*) as users_count
FROM users as u
GROUP BY 1
ORDER BY 1

<b>Задача 57</b>

Вновь разбейте пользователей из таблицы users на группы по возрасту (возраст по-прежнему измеряем количеством полных лет), только теперь добавьте в группировку ещё и пол пользователя. Затем посчитайте количество пользователей в каждой половозрастной группе.

Все NULL значения в колонке birth_date заранее отфильтруйте с помощью WHERE.

Колонку с возрастом назовите age, а колонку с числом пользователей — users_count, имя колонки с полом оставьте без изменений. Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст был выражен целым числом.

Отсортируйте полученную таблицу сначала по колонке с возрастом по возрастанию, затем по колонке с полом — тоже по возрастанию.

Поля в результирующей таблице: age, sex, users_count

In [ ]:
SELECT DATE_PART('year', AGE(current_date, u.birth_date))::integer as age,
       u.sex,
       COUNT(*) as users_count
FROM users as u
WHERE u.birth_date is not null
GROUP BY 1, 2
ORDER BY 1, 2

<b>Задача 58</b>

Посчитайте количество товаров в каждом заказе, примените к этим значениям группировку и рассчитайте количество заказов в каждой группе за неделю с 29 августа по 4 сентября 2022 года включительно. Для расчётов используйте данные из таблицы orders.

Выведите две колонки: размер заказа и число заказов такого размера за указанный период. Колонки назовите соответственно order_size и orders_count.

Результат отсортируйте по возрастанию размера заказа.

Поля в результирующей таблице: order_size, orders_count

In [ ]:
SELECT array_length(o.product_ids, 1) as order_size,
       COUNT(*) as orders_count
FROM orders as o
WHERE o.creation_time BETWEEN '2022-08-29' AND '2022-09-05'
GROUP BY 1
ORDER BY 1

<b>Задача 59</b>

Посчитайте количество товаров в каждом заказе, примените к этим значениям группировку и рассчитайте количество заказов в каждой группе. Учитывайте только заказы, оформленные по будням. В результат включите только те размеры заказов, общее число которых превышает 2000. Для расчётов используйте данные из таблицы orders.

Выведите две колонки: размер заказа и число заказов такого размера. Колонки назовите соответственно order_size и orders_count.

Результат отсортируйте по возрастанию размера заказа.

Поля в результирующей таблице: order_size, orders_count

Когда решите эту задачу, вернитесь к одной из предыдущих и подумайте, могли бы мы ещё каким-то способом сделать так, чтобы в результат не попала группа с NULL значениями. Можете самостоятельно написать ещё один запрос и попробовать сдать его в качестве альтернативного решения.

In [ ]:
SELECT array_length(o.product_ids, 1) as order_size,
       COUNT(*) as orders_count
FROM orders as o
WHERE DATE_PART('isodow', o.creation_time)::integer BETWEEN 1 AND 5
GROUP BY 1
HAVING COUNT(*) > 2000
ORDER BY 1

<b>Задача 60</b>

По данным из таблицы user_actions определите пять пользователей, сделавших в августе 2022 года наибольшее количество заказов.

Выведите две колонки — id пользователей и число оформленных ими заказов. Колонку с числом оформленных заказов назовите created_orders.

Результат отсортируйте сначала по убыванию числа заказов, сделанных пятью пользователями, затем по возрастанию id этих пользователей.

Поля в результирующей таблице: user_id, created_orders

In [ ]:
SELECT ua.user_id,
       COUNT(*) as created_orders
FROM user_actions as ua
WHERE ua.action = 'create_order'
AND DATE_PART('month', ua.time) = 8
GROUP BY 1
ORDER BY 2 DESC, 1
LIMIT 5

<b>Задача 61</b>

А теперь по данным таблицы courier_actions определите курьеров, которые в сентябре 2022 года доставили только по одному заказу.

В этот раз выведите всего одну колонку с id курьеров. Колонку с числом заказов в результат включать не нужно.

Результат отсортируйте по возрастанию id курьера.

Поле в результирующей таблице: courier_id

In [ ]:
SELECT ca.courier_id
FROM courier_actions as ca
WHERE DATE_PART('month', ca.time) = 9
AND DATE_PART('year', ca.time) = 2022
AND ca.action = 'deliver_order'
GROUP BY 1
HAVING COUNT(DISTINCT ca.order_id) = 1
ORDER BY 1

<b>Задача 62</b>

Из таблицы user_actions отберите пользователей, у которых последний заказ был создан до 8 сентября 2022 года.

Выведите только их id, дату создания заказа выводить не нужно.

Результат отсортируйте по возрастанию id пользователя.

Поле в результирующей таблице: user_id

In [ ]:
SELECT ua.user_id
FROM user_actions as ua
WHERE ua.action = 'create_order'
GROUP BY 1
HAVING MAX(ua.time) < '2022-09-08'
ORDER BY 1

<b>Задача 63</b>

По данным из таблицы orders рассчитайте средний размер заказа по выходным и по будням.

Группу с выходными днями (суббота и воскресенье) назовите «weekend», а группу с будними днями (с понедельника по пятницу) — «weekdays» (без кавычек).

В результат включите две колонки: колонку с группами назовите week_part, а колонку со средним размером заказа — avg_order_size.

Средний размер заказа округлите до двух знаков после запятой.

Результат отсортируйте по колонке со средним размером заказа — по возрастанию.

Поля в результирующей таблице: week_part, avg_order_size

In [ ]:
SELECT
      CASE
      WHEN DATE_PART('dow', o.creation_time) BETWEEN 1 AND 5 THEN 'weekdays'
      WHEN DATE_PART('dow', o.creation_time) IN (6, 0) THEN 'weekend'
      END as week_part,
      ROUND(AVG(ARRAY_LENGTH(o.product_ids, 1)), 2) as avg_order_size
FROM orders as o
GROUP BY 1
ORDER BY 2

<b>Задача 64</b>

Разбейте пользователей из таблицы users на 4 возрастные группы:

от 19 до 24 лет;<br>
от 25 до 29 лет;<br>
от 30 до 35 лет;<br>
от 36 до 41 года.<br>
Посчитайте число пользователей, попавших в каждую возрастную группу. Группы назовите соответственно «19-24», «25-29», «30-35», «36-41» (без кавычек).

Выведите наименования групп и число пользователей в них. Колонку с наименованием групп назовите group_age, а колонку с числом пользователей — users_count.

Отсортируйте полученную таблицу по колонке с наименованием групп по возрастанию.

Поля в результирующей таблице: group_age, users_count

In [ ]:
SELECT
      CASE
      WHEN DATE_PART('year', AGE(current_date, u.birth_date))::integer BETWEEN 19 AND 24 THEN '19-24'
      WHEN DATE_PART('year', AGE(current_date, u.birth_date))::integer BETWEEN 25 and 29 THEN '25-29'
      WHEN DATE_PART('year', AGE(current_date, u.birth_date))::integer BETWEEN 30 and 35 THEN '30-35'
      WHEN DATE_PART('year', AGE(current_date, u.birth_date))::integer BETWEEN 36 and 41 THEN '36-41'
      END as group_age,
      COUNT(u.user_id) as users_count
FROM users as u
WHERE u.birth_date IS NOT NULL
GROUP BY 1
ORDER BY 1

<b>Задача 65</b>

Для каждого пользователя в таблице user_actions посчитайте общее количество оформленных заказов и долю отменённых заказов.

Новые колонки назовите соответственно orders_count и cancel_rate. Колонку с долей отменённых заказов округлите до двух знаков после запятой.

В результат включите только тех пользователей, которые оформили больше трёх заказов и у которых показатель cancel_rate составляет не менее 0.5.

Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, orders_count, cancel_rate

In [ ]:
SELECT ua.user_id,
       COUNT(DISTINCT ua.order_id) as orders_count,
       ROUND(COUNT(DISTINCT ua.order_id) FILTER(WHERE ua.action = 'cancel_order')::decimal / COUNT(DISTINCT ua.order_id), 2) as cancel_rate
FROM user_actions as ua
GROUP BY 1
HAVING COUNT(DISTINCT ua.order_id) > 3
AND ROUND(COUNT(DISTINCT ua.order_id) FILTER(WHERE  ua.action = 'cancel_order')::decimal / COUNT(DISTINCT ua.order_id), 2) >= 0.5
ORDER BY 1

<b>Задача 66</b>

Для каждого дня недели в таблице user_actions посчитайте:

Общее количество оформленных заказов.<br>
Общее количество отменённых заказов.<br>
Общее количество неотменённых заказов (т.е. доставленных).<br>
Долю неотменённых заказов в общем числе заказов (success rate).<br>
Новые колонки назовите соответственно created_orders, canceled_orders, actual_orders и success_rate. Колонку с долей неотменённых заказов округлите до трёх знаков после запятой.

Все расчёты проводите за период с 24 августа по 6 сентября 2022 года включительно, чтобы во временной интервал попало равное количество разных дней недели.

In [ ]:
SELECT DATE_PART('isodow', ua.time)::integer as weekday_number,
       TO_CHAR(ua.time, 'Dy') as weekday,
       COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'create_order') as created_orders,
       COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'cancel_order') as canceled_orders,
       COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'create_order') - COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'cancel_order') as actual_orders,
       ROUND((COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'create_order') - COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'cancel_order'))::decimal / COUNT(DISTINCT ua.order_id) FILTER (WHERE ua.action = 'create_order'), 3) as success_rate
FROM user_actions as ua
WHERE ua.time BETWEEN '2022-08-24'
AND '2022-09-07'
GROUP BY 1, 2
ORDER BY 1

<b>Задача 67</b>

Используя данные из таблицы user_actions, рассчитайте среднее число заказов всех пользователей нашего сервиса.

Для этого сначала в подзапросе посчитайте, сколько заказов сделал каждый пользователь, а затем обратитесь к результату подзапроса в блоке FROM и уже в основном запросе усредните количество заказов по всем пользователям.

Полученное среднее число заказов всех пользователей округлите до двух знаков после запятой. Колонку с этим значением назовите orders_avg.

Поле в результирующей таблице: orders_avg

In [ ]:
SELECT ROUND(AVG(orders_count), 2) as orders_avg
FROM (SELECT user_id,
             COUNT(order_id) as orders_count
      FROM user_actions
      WHERE action = 'create_order'
      GROUP BY user_id) as t1

<b>Задача 68</b>

Повторите запрос из предыдущего задания, но теперь вместо подзапроса используйте оператор WITH и табличное выражение. Условия задачи те же.

Поле в результирующей таблице: orders_avg

In [ ]:
WITH subquery_1 as (SELECT user_id,
                           COUNT(order_id) as orders_count
                    FROM  user_actions
                    WHERE action = 'create_order'
                    GROUP BY 1)

SELECT ROUND(AVG(orders_count), 2) as orders_avg
FROM subquery_1

<b>Задача 69</b>

Выведите из таблицы products информацию о всех товарах кроме самого дешёвого. Результат отсортируйте по убыванию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price
FROM products as p
WHERE p.price != (SELECT MIN(p.price)
                  FROM products as p)
ORDER BY 1 DESC

<b>Задача 70</b>

Выведите информацию о товарах в таблице products, цена на которые превышает среднюю цену всех товаров на 20 рублей и более. Результат отсортируйте по убыванию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price
FROM products as p
WHERE p.price >= (SELECT AVG(p.price)
                  FROM products as p) + 20
ORDER BY 1 DESC

<b>Задача 71</b>

Посчитайте количество уникальных клиентов в таблице user_actions, сделавших за последнюю неделю хотя бы один заказ. Полученную колонку со значением назовите users_count. В качестве текущей даты, от которой откладывать неделю, используйте последнюю дату в той же таблице user_actions.

Поле в результирующей таблице: users_count

In [ ]:
SELECT COUNT(DISTINCT ua.user_id) as users_count
FROM user_actions as ua
WHERE ua.time >= (SELECT MAX(ua.time)
                  FROM user_actions as ua) - INTERVAL '1 week'
                  AND ua.action = 'create_order'

<b>Задача 72</b>

С помощью функции AGE() и агрегирующей функции снова рассчитайте возраст самого молодого курьера мужского пола в таблице couriers, но в этот раз в качестве первой даты используйте последнюю дату из таблицы courier_actions. Чтобы получилась именно дата, перед применением функции AGE() переведите посчитанную последнюю дату в формат DATE, как мы делали в этом задании. Возраст курьера измерьте количеством лет, месяцев и дней и переведите его в тип VARCHAR. Полученную колонку со значением возраста назовите min_age.

Поле в результирующей таблице: min_age

In [ ]:
SELECT MIN(AGE((SELECT MAX(ca.time)
                FROM courier_actions as ca)::date, c.birth_date)::varchar) as min_age
FROM couriers as c
WHERE c.sex = 'male'

<b>Задача 73</b>

Из таблицы user_actions с помощью подзапроса или табличного выражения отберите все заказы, которые не были отменены пользователями. Выведите колонку с id этих заказов. Результат запроса отсортируйте по возрастанию id заказа. Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поле в результирующей таблице: order_id

In [ ]:
WITH subquery_1 as (SELECT ua.order_id
                    FROM user_actions as ua
                    WHERE action = 'cancel_order')
SELECT ua.order_id
FROM user_actions as ua
WHERE ua.order_id NOT IN (SELECT *
                          FROM subquery_1)
ORDER BY 1
LIMIT 1000

<b>Задача 74</b>

Используя данные из таблицы user_actions, рассчитайте, сколько заказов сделал каждый пользователь и отразите это в столбце orders_count. В отдельном столбце orders_avg напротив каждого пользователя укажите среднее число заказов всех пользователей, округлив его до двух знаков после запятой. Также для каждого пользователя посчитайте отклонение числа заказов от среднего значения. Отклонение считайте так: число заказов «минус» округлённое среднее значение. Колонку с отклонением назовите orders_diff. Результат отсортируйте по возрастанию id пользователя. Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: user_id, orders_count, orders_avg, orders_diff

In [ ]:
WITH subquery_1 as (SELECT ua.user_id,
                           COUNT(DISTINCT ua.order_id) as orders_count
                    FROM user_actions as ua
                    WHERE ua.action = 'create_order'
                    GROUP BY 1),

subquery_2 as (SELECT ROUND(AVG(orders_count), 2) as orders_avg
               FROM subquery_1)
SELECT user_id,
       orders_count,
       (SELECT orders_avg
        FROM subquery_2),
       orders_count - (SELECT orders_avg
                       FROM subquery_2) as orders_diff
FROM subquery_1
ORDER BY 1
LIMIT 1000

<b>Задача 75

Выведите id и содержимое 100 последних доставленных заказов из таблицы orders. Содержимым заказов считаются списки с id входящих в заказ товаров. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, product_ids

In [ ]:
WITH subquery_1 as(SELECT ca.order_id
                   FROM courier_actions as ca
                   WHERE ca.action = 'deliver_order'
                   ORDER BY ca.time DESC
                   LIMIT 100)

SELECT o.order_id,
       o.product_ids
FROM orders as o
WHERE o.order_id IN (SELECT *
                      FROM subquery_1)
ORDER BY 1

<b>Задача 76</b>

Из таблицы couriers выведите всю информацию о курьерах, которые в сентябре 2022 года доставили 30 и более заказов. Результат отсортируйте по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_date, sex

In [ ]:
WITH subquery_1 as(SELECT ca.courier_id
                   FROM courier_actions as ca
                   WHERE ca.action = 'deliver_order'
                   AND DATE_PART('month', ca.time) = 9
                   AND DATE_PART('year', ca.time) = 2022
                   GROUP BY 1
                   HAVING COUNT(ca.order_id) >= 30)

SELECT c.courier_id,
       c.birth_date,
       c.sex
FROM couriers as c
WHERE c.courier_id IN (SELECT *
                       FROM subquery_1)
ORDER BY 1

<b>Задача 77</b>

Назначьте скидку 15% на товары, цена которых превышает среднюю цену на все товары на 50 и более рублей, а также скидку 10% на товары, цена которых ниже средней на 50 и более рублей. Цену остальных товаров внутри диапазона (среднее - 50; среднее + 50) оставьте без изменений. При расчёте средней цены, округлите её до двух знаков после запятой.

Выведите информацию о всех товарах с указанием старой и новой цены. Колонку с новой ценой назовите new_price. Результат отсортируйте сначала по убыванию прежней цены в колонке price, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       CASE WHEN p.price > (SELECT ROUND(AVG(p.price), 2)
                            FROM products as p) + 50 THEN p.price * 0.85
            WHEN p.price < (SELECT ROUND(AVG(p.price), 2)
                            FROM products as p) - 50 THEN p.price * 0.90
            ELSE p.price
            END as new_price
FROM products as p
ORDER BY 3 DESC, 1

<b>Задача 78</b>

Выберите все колонки из таблицы orders, но в качестве последней колонки укажите функцию unnest, применённую к колонке product_ids. Новую колонку назовите product_id. Выведите только первые 100 записей результирующей таблицы. Посмотрите на результат работы функции unnest и постарайтесь разобраться, что произошло с исходной таблицей.

Поля в результирующей таблице: creation_time, order_id, product_ids, product_id

In [ ]:
SELECT o.creation_time,
       o.order_id,
       o.product_ids,
       UNNEST(o.product_ids) as product_id
FROM orders as o
LIMIT 100

<b>Задача 79</b>

Используя функцию unnest, определите 10 самых популярных товаров в таблице orders. Самыми популярными будем считать те, которые встречались в заказах чаще всего. Если товар встречается в одном заказе несколько раз (т.е. было куплено несколько единиц товара), то это тоже учитывается при подсчёте.

Выведите id товаров и сколько раз они встречались в заказах. Новую колонку с количеством покупок товара назовите times_purchased.

Поля в результирующей таблице: product_id, times_purchased

In [ ]:
WITH subquery_1 as(
    SELECT UNNEST(o.product_ids) as product_id
    FROM orders as o)

SELECT product_id,
       COUNT(product_id) as times_purchased
FROM subquery_1
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10

<b>Задача 80</b>

Из таблицы orders выведите id и содержимое заказов, которые включают хотя бы один из пяти самых дорогих товаров, доступных в нашем сервисе. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, product_ids

In [ ]:
WITH subquery_1 as (
    SELECT DISTINCT p.product_id,
                    p.price
    FROM products as p
    ORDER BY 2 DESC
    LIMIT 5),

    subquery_2 as(
    SELECT DISTINCT o.order_id,
                    o.product_ids,
                    UNNEST(o.product_ids) as product_id
    FROM orders as o)

SELECT DISTINCT order_id,
                product_ids
FROM subquery_2
WHERE product_id IN (SELECT product_id
                      FROM subquery_1)
ORDER BY 1

<b>Задача 81</b>

Посчитайте возраст каждого пользователя в таблице users. Возраст измерьте числом полных лет, как мы делали в прошлых уроках. Возраст считайте относительно последней даты в таблице user_actions. В результат включите колонки с id пользователя и возрастом. Для тех пользователей, у которых в таблице users не указана дата рождения, укажите среднее значение возраста всех остальных пользователей, округлённое до целого числа. Колонку с возрастом назовите age. Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, age

In [ ]:
WITH subquery_1 as (SELECT u.user_id,
                    DATE_PART('year', AGE((SELECT MAX(ua.time)
                                           FROM user_actions as ua), u.birth_date)) as age
                   FROM users as u)
SELECT user_id,
       COALESCE(age, (SELECT ROUND(AVG(age))
               FROM subquery_1)) as age
FROM subquery_1
ORDER BY 1

<b>Задача 82</b>

Объедините таблицы user_actions и users по ключу user_id. В результат включите две колонки с user_id из обеих таблиц. Эти две колонки назовите соответственно user_id_left и user_id_right. Также в результат включите колонки order_id, time, action, sex, birth_date. Отсортируйте получившуюся таблицу по возрастанию id пользователя (в любой из двух колонок с id).

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
SELECT ua.user_id as user_id_left,
       u.user_id as user_id_right,
       order_id,
       time,
       action,
       sex,
       birth_date
FROM  user_actions as ua
INNER JOIN users as u
USING(user_id)
ORDER BY 1

<b>Задача 83</b>

А теперь попробуйте немного переписать запрос из прошлого задания и посчитать количество уникальных id в объединённой таблице. То есть снова объедините таблицы, но в этот раз просто посчитайте уникальные user_id в одной из колонок с id. Выведите это количество в качестве результата. Колонку с посчитанным значением назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
SELECT count(distinct ua.user_id) as users_count
FROM user_actions as ua
INNER JOIN users as u
USING(user_id)

<b>Задача 84</b>

С помощью LEFT JOIN объедините таблицы user_actions и users по ключу user_id. Обратите внимание на порядок таблиц — слева users_actions, справа users. В результат включите две колонки с user_id из обеих таблиц. Эти две колонки назовите соответственно user_id_left и user_id_right. Также в результат включите колонки order_id, time, action, sex, birth_date. Отсортируйте получившуюся таблицу по возрастанию id пользователя (в колонке из левой таблицы).

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
SELECT ua.user_id as user_id_left,
       u.user_id as user_id_right,
       order_id,
       time,
       action,
       sex,
       birth_date
FROM user_actions as ua
LEFT JOIN users as u
USING(user_id)
ORDER BY 1

<b>Задача 85</b>

Теперь снова попробуйте немного переписать запрос из прошлого задания и посчитайте количество уникальных id в колонке user_id, пришедшей из левой таблицы user_actions. Выведите это количество в качестве результата. Колонку с посчитанным значением назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
SELECT count(distinct ua.user_id) as users_count
FROM user_actions as ua
LEFT JOIN users as u
USING(user_id)

<b>Задача 86</b>

Возьмите запрос из задания 84, где вы объединяли таблицы user_actions и users с помощью LEFT JOIN, добавьте к запросу оператор WHERE и исключите NULL значения в колонке user_id из правой таблицы. Включите в результат все те же колонки и отсортируйте получившуюся таблицу по возрастанию id пользователя в колонке из левой таблицы.

Поля в результирующей таблице: user_id_left, user_id_right,  order_id, time, action, sex, birth_date

In [ ]:
SELECT ua.user_id as user_id_left,
       u.user_id as user_id_right,
       order_id,
       time,
       action,
       sex,
       birth_date
FROM user_actions as ua
LEFT JOIN users as u
USING(user_id)
WHERE  u.user_id is not null
ORDER BY 1

<b>Задача 87</b>

С помощью FULL JOIN объедините по ключу birth_date таблицы, полученные в результате вышеуказанных запросов (то есть объедините друг с другом два подзапроса). Не нужно изменять их, просто добавьте нужный JOIN.

В результат включите две колонки с birth_date из обеих таблиц. Эти две колонки назовите соответственно users_birth_date и couriers_birth_date. Также включите в результат колонки с числом пользователей и курьеров — users_count и couriers_count.

Отсортируйте получившуюся таблицу сначала по колонке users_birth_date по возрастанию, затем по колонке couriers_birth_date — тоже по возрастанию.

Поля в результирующей таблице: users_birth_date, users_count,  couriers_birth_date, couriers_count

In [ ]:
WITH users_birth as(SELECT birth_date,
                           COUNT(user_id) as users_count
                    FROM users
                    WHERE birth_date IS NOT null
                    GROUP BY birth_date),

couriers_birth as (SELECT birth_date,
                          COUNT(courier_id) as couriers_count
                   FROM couriers
                   WHERE birth_date IS NOT NULL
                   GROUP BY birth_date)

SELECT ub.birth_date as users_birth_date,
       ub.users_count,
       cb.birth_date as couriers_birth_date,
       cb.couriers_count
FROM users_birth as ub
FULL JOIN couriers_birth as cb
USING(birth_date)
ORDER BY 1, 3

<b>Задача 88</b>

Объедините два следующих запроса друг с другом так, чтобы на выходе получился набор уникальных дат из таблиц users и couriers:

SELECT birth_date
FROM users
WHERE birth_date IS NOT NULL


SELECT birth_date
FROM couriers
WHERE birth_date IS NOT NULL


Поместите в подзапрос полученный после объединения набор дат и посчитайте их количество. Колонку с числом дат назовите dates_count.

Поле в результирующей таблице: dates_count

In [ ]:
WITH birth_dates as (
SELECT birth_date
FROM users
WHERE birth_date IS NOT NULL
UNION
SELECT birth_date
FROM couriers
WHERE birth_date IS NOT NULL)

SELECT COUNT(birth_date) as dates_count
FROM birth_dates

<b>Задача 89</b>

Из таблицы users отберите id первых 100 пользователей (просто выберите первые 100 записей, используя простой LIMIT) и с помощью CROSS JOIN объедините их со всеми наименованиями товаров из таблицы products. Выведите две колонки — id пользователя и наименование товара. Результат отсортируйте сначала по возрастанию id пользователя, затем по имени товара — тоже по возрастанию.

Поля в результирующей таблице: user_id, name

In [ ]:
WITH first_id_us as(
SELECT user_id
FROM users
LIMIT 100)

SELECT user_id,
       name
FROM  first_id_us
CROSS JOIN products
ORDER BY 1, 2

<b>Задача 90</b>

Для начала объедините таблицы user_actions и orders — это вы уже умеете делать. В качестве ключа используйте поле order_id. Выведите id пользователей и заказов, а также список товаров в заказе. Отсортируйте таблицу по id пользователя по возрастанию, затем по id заказа — тоже по возрастанию.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: user_id, order_id, product_ids

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       o.product_ids
FROM  user_actions as ua
LEFT JOIN orders as o
USING(order_id)
ORDER BY 1, 2
LIMIT 1000

<b>Задача 91</b>

Снова объедините таблицы user_actions и orders, но теперь оставьте только уникальные неотменённые заказы (мы делали похожий запрос на прошлом уроке). Остальные условия задачи те же: вывести id пользователей и заказов, а также список товаров в заказе. Отсортируйте таблицу по id пользователя по возрастанию, затем по id заказа — тоже по возрастанию.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: user_id, order_id, product_ids

In [ ]:
WITH not_cancel_orders as(
SELECT *
FROM user_actions
WHERE order_id NOT IN (SELECT order_id
                        FROM user_actions
                        WHERE action = 'cancel_order')
)

SELECT user_id,
       order_id,
       product_ids
FROM not_cancel_orders
JOIN orders
USING(order_id)
ORDER BY 1, 2
LIMIT 1000

<b>Задача 92</b>

Используя запрос из предыдущего задания, посчитайте, сколько в среднем товаров заказывает каждый пользователь. Выведите id пользователя и среднее количество товаров в заказе. Среднее значение округлите до двух знаков после запятой. Колонку посчитанными значениями назовите avg_order_size. Результат выполнения запроса отсортируйте по возрастанию id пользователя.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: user_id, avg_order_size

In [ ]:
WITH not_cancel_orders as(
SELECT *
FROM user_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions
                       WHERE action = 'cancel_order')
)

SELECT user_id,
       ROUND(AVG(ARRAY_LENGTH(product_ids, 1)), 2) as avg_order_size
FROM not_cancel_orders
JOIN orders
USING(order_id)
GROUP BY 1
ORDER BY 1
LIMIT 1000

<b>Задача 93</b>

Для начала к таблице с заказами (orders) примените функцию unnest, как мы делали в прошлом уроке. Колонку с id товаров назовите product_id. Затем к образовавшейся расширенной таблице по ключу product_id добавьте информацию о ценах на товары (из таблицы products). Должна получиться таблица с заказами, товарами внутри каждого заказа и ценами на эти товары. Выведите колонки с id заказа, id товара и ценой товара. Результат отсортируйте сначала по возрастанию id заказа, затем по возрастанию id товара.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: order_id, product_id, price

In [ ]:
WITH order_product as(
SELECT order_id,
UNNEST(product_ids) as product_id
FROM orders
)

SELECT order_id,
       product_id,
       price
FROM order_product
LEFT JOIN products
USING(product_id)
ORDER BY 1, 2
LIMIT 1000

<b>Задача 94</b>

Используя запрос из предыдущего задания, рассчитайте суммарную стоимость каждого заказа. Выведите колонки с id заказов и их стоимостью. Колонку со стоимостью заказа назовите order_price. Результат отсортируйте по возрастанию id заказа.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: order_id, order_price

In [ ]:
WITH order_product as(
SELECT order_id,
UNNEST(product_ids) as product_id
FROM orders
)

SELECT order_id,
       SUM(price) as order_price
FROM order_product
LEFT JOIN products
USING(product_id)
GROUP BY 1
ORDER BY 1
LIMIT 1000

<b>Задача 95</b>

Объедините запрос из предыдущего задания с частью запроса, который вы составили в задаче 11, то есть объедините запрос со стоимостью заказов с запросом, в котором вы считали размер каждого заказа из таблицы user_actions.

На основе объединённой таблицы для каждого пользователя рассчитайте следующие показатели:

общее число заказов — колонку назовите orders_count
среднее количество товаров в заказе — avg_order_size
суммарную стоимость всех покупок — sum_order_value
среднюю стоимость заказа — avg_order_value
минимальную стоимость заказа — min_order_value
максимальную стоимость заказа — max_order_value
Полученный результат отсортируйте по возрастанию id пользователя.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Помните, что в расчётах мы по-прежнему учитываем только неотменённые заказы. При расчёте средних значений, округляйте их до двух знаков после запятой.

Поля в результирующей таблице:

user_id, orders_count, avg_order_size, sum_order_value, avg_order_value, min_order_value, max_order_value

In [ ]:
WITH t1 as(SELECT user_id,
                  order_id
           FROM user_actions
           WHERE order_id NOT IN (SELECT order_id
                                   FROM user_actions
                                   WHERE action = 'cancel_order')),
t2 as(SELECT order_id,
             SUM(price) as order_price
      FROM (SELECT order_id,
                   product_ids,
                   UNNEST(product_ids) as product_id
            FROM orders) as sub
LEFT JOIN products
USING(product_id)
GROUP BY 1)

SELECT user_id,
       COUNT(order_id) as orders_count,
       ROUND(AVG(ARRAY_LENGTH(product_ids, 1)), 2) as avg_order_size,
       SUM(order_price) as sum_order_value,
       ROUND(avg(order_price), 2) as avg_order_value,
       MIN(order_price) as min_order_value,
       MAX(order_price) as max_order_value
FROM t1
LEFT JOIN t2 using(order_id)
LEFT JOIN orders using(order_id)
GROUP BY 1
ORDER BY 1
LIMIT 1000

<b>Задача 96</b>

По таблицам courier_actions , orders и products определите 10 самых популярных товаров, доставленных в сентябре 2022 года. Самыми популярными товарами будем считать те, которые встречались в заказах чаще всего. Если товар встречается в одном заказе несколько раз (было куплено несколько единиц товара), то при подсчёте учитываем только одну единицу товара. Выведите наименования товаров и сколько раз они встречались в заказах. Новую колонку с количеством покупок товара назовите times_purchased.

Поля в результирующей таблице: name, times_purchased

In [ ]:
SELECT name,
       COUNT(DISTINCT order_id) as times_purchased
FROM (SELECT order_id
      FROM courier_actions
      WHERE action = 'deliver_order'
      AND DATE_PART('month', time) = 9
      AND DATE_PART('year', time) = 2022) as t1
LEFT JOIN (SELECT order_id,
                  UNNEST(product_ids) as product_id
          FROM orders) as t2 using(order_id)
LEFT JOIN products
USING(product_id)
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10

<b>Задача 97</b>

Возьмите запрос, составленный на одном из прошлых уроков, и подтяните в него из таблицы users данные о поле пользователей таким образом, чтобы все пользователи из таблицы user_actions остались в результате. Затем посчитайте среднее значение cancel_rate для каждого пола, округлив его до трёх знаков после запятой. Колонку с посчитанным средним значением назовите avg_cancel_rate.

Помните про отсутствие информации о поле некоторых пользователей после join, так как не все пользователи из таблицы user_action есть в таблице users. Для этой группы тоже посчитайте cancel_rate и в результирующей таблице для пустого значения в колонке с полом укажите ‘unknown’ (без кавычек). Возможно, для этого придётся вспомнить, как работает COALESCE.

Результат отсортируйте по колонке с полом пользователя по возрастанию.

Поля в результирующей таблице: sex, avg_cancel_rate

In [ ]:
WITH t1 as(SELECT ua.user_id,
                  COUNT(DISTINCT ua.order_id) as orders_count,
                  ROUND(COUNT(DISTINC ua.order_id) FILTER (WHERE ua.action = 'cancel_order')::decimal / COUNT(DISTINCT ua.order_id),2) as cancel_rate
           FROM user_actions as ua
           GROUP BY 1)

SELECT COALESCE(sex, 'unknown') as sex,
       ROUND(AVG(cancel_rate), 3) as avg_cancel_rate
FROM t1
LEFT JOIN users
USING(user_id)
GROUP BY 1
ORDER BY 1

<b>Задача 98</b>

Произведите замену списков с id товаров из таблицы orders на списки с наименованиями товаров. Наименования возьмите из таблицы products. Колонку с новыми списками наименований назовите product_names.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: order_id, product_names

In [ ]:
SELECT order_id,
       ARRAY_AGG(name) as product_names
FROM (SELECT order_id,
             UNNEST(product_ids) as product_id
      FROM orders) as t1
LEFT JOIN products
USING(product_id)
GROUP BY 1
LIMIT 1000

<b>Задача 99</b>

Выясните, кто заказывал и доставлял самые большие заказы. Самыми большими считайте заказы с наибольшим числом товаров.

Выведите id заказа, id пользователя и id курьера. Также в отдельных колонках укажите возраст пользователя и возраст курьера. Возраст измерьте числом полных лет, как мы делали в прошлых уроках. Считайте его относительно последней даты в таблице user_actions — как для пользователей, так и для курьеров. Колонки с возрастом назовите user_age и courier_age. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, user_id, user_age, courier_id, courier_age

In [ ]:
SELECT DISTINCT order_id,
                user_id,
                DATE_PART('year', AGE((SELECT MAX(time)
                                       FROM user_actions)::date, u.birth_date))::integer as user_age,
                courier_id,
                date_part('year', age((SELECT MAX(time)
                                       FROM courier_actions)::date, c.birth_date))::integer as courier_age
FROM users as u
JOIN user_actions as ua
USING(user_id)
JOIN orders
USING(order_id)
JOIN courier_actions as ca
USING(order_id)
JOIN couriers as c
USING(courier_id)
WHERE order_id IN (SELECT order_id
                    FROM orders
                    WHERE ARRAY_LENGTH(product_ids, 1) IN (SELECT MAX(ARRAY_LENGTH(product_ids, 1))
                                                           FROM orders))
ORDER BY 1

<b>Задача 100</b>

Выясните, какие пары товаров покупают вместе чаще всего.

Пары товаров сформируйте на основе таблицы с заказами. Отменённые заказы не учитывайте. В качестве результата выведите две колонки — колонку с парами наименований товаров и колонку со значениями, показывающими, сколько раз конкретная пара встретилась в заказах пользователей. Колонки назовите соответственно pair и count_pair.

Пары товаров должны быть представлены в виде списков из двух наименований. Пары товаров внутри списков должны быть отсортированы в порядке возрастания наименования. Результат отсортируйте сначала по убыванию частоты встречаемости пары товаров в заказах, затем по колонке pair — по возрастанию.

Поля в результирующей таблице: pair, count_pair

In [ ]:
WITH sub_1 as (SELECT DISTINCT order_id,
                               UNNEST(product_ids) as product_id
               FROM orders
               WHERE order_id NOT IN (SELECT order_id
                                       FROM user_actions
                                       WHERE action = 'cancel_order')),
sub_2 as (SELECT order_id,
                 name
          FROM sub_1
          JOIN products
          USING(product_id))


SELECT ARRAY[t1.name, t2.name] as pair,
       COUNT(ARRAY[t1.name, t2.name]) as count_pair
FROM sub_2 as t1
JOIN sub_2 as t2 ON t2.order_id = t1.order_id
and t2.name > t1.name
GROUP BY 1
ORDER BY 2 DESC, 1

<b>Задача 101</b>

Примените оконные функции к таблице products и с помощью ранжирующих функций упорядочьте все товары по цене — от самых дорогих к самым дешёвым. Добавьте в таблицу следующие колонки:

Колонку product_number с порядковым номером товара (функция ROW_NUMBER).
Колонку product_rank с рангом товара с пропусками рангов (функция RANK).
Колонку product_dense_rank с рангом товара без пропусков рангов (функция DENSE_RANK).
Не забывайте указывать в окне сортировку записей — без неё ранжирующие функции могут давать некорректный результат, если таблица заранее не отсортирована. Деление на партиции внутри окна сейчас не требуется. Сортировать записи в результирующей таблице тоже не нужно.

Поля в результирующей таблице: product_id, name, price, product_number, product_rank, product_dense_rank

In [ ]:
SELECT product_id,
       name,
       price,
       ROW_NUMBER() OVER(ORDER BY price DESC) as product_number,
       RANK() OVER(ORDER BY price DESC) as product_rank,
       DENSE_RANK() OVER(ORDER BY price DESC) as product_dense_rank
FROM products

<b>Задача 102</b>

Примените оконную функцию к таблице products и с помощью агрегирующей функции в отдельной колонке для каждой записи проставьте цену самого дорогого товара. Колонку с этим значением назовите max_price. Затем для каждого товара посчитайте долю его цены в стоимости самого дорогого товара — просто поделите одну колонку на другую. Полученные доли округлите до двух знаков после запятой. Колонку с долями назовите share_of_max.

Выведите всю информацию о товарах, включая значения в новых колонках. Результат отсортируйте сначала по убыванию цены товара, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, max_price, share_of_max

In [ ]:
SELECT product_id,
       name,
       price,
       MAX(price) OVER() as max_price,
       ROUND(price / MAX(price) OVER(), 2) as share_of_max
FROM products
ORDER BY 3 DESC, 1

<b>Задача 103</b>

Примените две оконные функции к таблице products — одну с агрегирующей функцией MAX, а другую с агрегирующей функцией MIN — для вычисления максимальной и минимальной цены. Для двух окон задайте инструкцию ORDER BY по убыванию цены. Поместите результат вычислений в две колонки max_price и min_price.

Выведите всю информацию о товарах, включая значения в новых колонках. Результат отсортируйте сначала по убыванию цены товара, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, max_price, min_price

In [ ]:
SELECT product_id,
       name,
       price,
       MAX(price) OVER(ORDER BY price DESC) as max_price,
       MIN(price) OVER(ORDER BY price DESC) as min_price
FROM products
ORDER BY 3 DESC, 1

<b>Задача 104</b>

Сначала на основе таблицы orders сформируйте новую таблицу с общим числом заказов по дням. При подсчёте числа заказов не учитывайте отменённые заказы (их можно определить по таблице user_actions). Колонку с днями назовите date, а колонку с числом заказов — orders_count.

Затем поместите полученную таблицу в подзапрос и примените к ней оконную функцию в паре с агрегирующей функцией SUM для расчёта накопительной суммы числа заказов. Не забудьте для окна задать инструкцию ORDER BY по дате.

Колонку с накопительной суммой назовите orders_cum_count. В результате такой операции значение накопительной суммы для последнего дня должно получиться равным общему числу заказов за весь период.

Сортировку результирующей таблицы делать не нужно.

Поля в результирующей таблице: date, orders_count, orders_cum_count

In [ ]:
WITH t1 as(
SELECT creation_time::date as date,
       COUNT(order_id) as orders_count
FROM orders
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions
                       WHERE action = 'cancel_order')
GROUP BY 1)

SELECT date,
       orders_count,
       SUM(orders_count) OVER(ORDER BY date)::integer as orders_cum_count
FROM t1
ORDER BY 1

<b>Задача 105</b>

Для каждого пользователя в таблице user_actions посчитайте порядковый номер каждого заказа. Для этого примените оконную функцию ROW_NUMBER к колонке с временем заказа. Не забудьте указать деление на партиции по пользователям и сортировку внутри партиций. Отменённые заказы не учитывайте. Новую колонку с порядковым номером заказа назовите order_number. Результат отсортируйте сначала по возрастанию id пользователя, затем по возрастанию order_number. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id, order_id, time, order_number

In [ ]:
SELECT user_id,
       order_id,
       time,
       ROW_NUMBER() OVER(PARTITION BY user_id ORDER BY time) as order_number
FROM user_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions
                       WHERE action = 'cancel_order')
ORDER BY 1, 4
LIMIT 1000

<b>Задача 106</b>

Дополните запрос из предыдущего задания и с помощью оконной функции для каждого заказа каждого пользователя рассчитайте, сколько времени прошло с момента предыдущего заказа.

Для этого сначала в отдельном столбце с помощью LAG сделайте смещение по столбцу time на одно значение назад. Столбец со смещёнными значениями назовите time_lag. Затем отнимите от каждого значения в колонке time новое значение со смещением (либо можете использовать уже знакомую функцию AGE). Колонку с полученным интервалом назовите time_diff. Менять формат отображения значений не нужно, они должны иметь примерно следующий вид:

3 days, 12:18:22


По-прежнему не учитывайте отменённые заказы. Также оставьте в запросе порядковый номер каждого заказа, рассчитанный на прошлом шаге. Результат отсортируйте сначала по возрастанию id пользователя, затем по возрастанию порядкового номера заказа. Добавьте LIMIT 1000.

Поля в результирующей таблице: user_id, order_id, time, order_number, time_lag, time_diff

In [ ]:
SELECT user_id,
       order_id,
       time,
       ROW_NUMBER() OVER(PARTITION BY user_id ORDER BY time) as order_number,
       LAG(time, 1) OVER(PARTITION BY user_id ORDER BY time) as time_lag,
       AGE(time, LAG(time, 1) OVER(PARTITION BY user_id ORDER BY time)) as time_diff
FROM user_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions
                       WHERE action = 'cancel_order')
ORDER BY 1, 4
LIMIT 1000

<b>Задача 107</b>

На основе запроса из предыдущего задания для каждого пользователя рассчитайте, сколько в среднем времени проходит между его заказами. Посчитайте этот показатель только для тех пользователей, которые за всё время оформили более одного неотмененного заказа.

Среднее время между заказами выразите в часах, округлив значения до целого числа. Колонку со средним значением времени назовите hours_between_orders. Результат отсортируйте по возрастанию id пользователя.

Добавьте в запрос оператор LIMIT и включите в результат только первые 1000 записей.

Поля в результирующей таблице: user_id, hours_between_orders

In [ ]:
WITH t1 as(SELECT user_id,
                  order_id,
                  time,
                  ROW_NUMBER() OVER(PARTITION BY user_id ORDER BY time) as order_number,
                  LAG(time, 1) OVER(PARTITION BY user_id ORDER BY time) as time_lag,
                  AGE(time, LAG(time, 1) OVER(PARTITION BY user_id ORDER BY time)) as time_diff
           FROM user_actions
           WHERE order_id NOT IN (SELECT order_id
                                  FROM user_actions
                                  WHERE action = 'cancel_order')
)

SELECT user_id,
       ROUND(AVG(extract(epoch FROM time_diff) /3600))::integer as hours_between_orders
FROM t1
GROUP BY 1
HAVING ROUND(AVG(extract(epoch FROM time_diff) /3600)) IS NOT NULL
ORDER BY 1
LIMIT 1000

<b>Задача 108</b>

Сначала на основе таблицы orders сформируйте новую таблицу с общим числом заказов по дням. Вы уже делали это в одной из предыдущих задач. При подсчёте числа заказов не учитывайте отменённые заказы (их можно определить по таблице user_actions). Колонку с числом заказов назовите orders_count.

Затем поместите полученную таблицу в подзапрос и примените к ней оконную функцию в паре с агрегирующей функцией AVG для расчёта скользящего среднего числа заказов. Скользящее среднее для каждой записи считайте по трём предыдущим дням. Подумайте, как правильно задать границы рамки, чтобы получить корректные расчёты.

Полученные значения скользящего среднего округлите до двух знаков после запятой. Колонку с рассчитанным показателем назовите moving_avg. Сортировку результирующей таблицы делать не нужно.

Поля в результирующей таблице: date, orders_count, moving_avg

In [ ]:
WITH t1 as (
SELECT creation_time::date as date,
       COUNT(order_id) as orders_count
FROM orders
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions
                       WHERE action = 'cancel_order')
GROUP BY 1)

SELECT date,
       orders_count,
       ROUND(AVG(orders_count) OVER(ORDER BY date ROWS BETWEEN 3 PRECEDING AND 1 PRECEDING),2) as moving_avg
FROM t1

<b>Задача 109</b>

Выясните, есть ли в таблице courier_actions такие заказы, которые были приняты курьерами, но не были созданы пользователями. Посчитайте количество таких заказов.

Колонку с числом заказов назовите orders_count.

Поле в результирующей таблице: orders_count

In [ ]:
SELECT COUNT(DISTINCT order_id) as orders_count
FROM courier_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM user_actions)

<b>Задача 110</b>

Выясните, есть ли в таблице courier_actions такие заказы, которые были приняты курьерами, но не были доставлены пользователям. Посчитайте количество таких заказов.

Колонку с числом заказов назовите orders_count.

Поле в результирующей таблице: orders_count

In [ ]:
SELECT COUNT(DISTINCT order_id) as orders_count
FROM courier_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM courier_actions
                       WHERE action = 'deliver_order')

<b>Задача 111</b>

Определите количество отменённых заказов в таблице courier_actions и выясните, есть ли в этой таблице такие заказы, которые были отменены пользователями, но при этом всё равно были доставлены. Посчитайте количество таких заказов.

Колонку с отменёнными заказами назовите orders_canceled. Колонку с отменёнными, но доставленными заказами назовите orders_canceled_and_delivered.

Поля в результирующей таблице: orders_canceled, orders_canceled_and_delivered

In [ ]:
SELECT COUNT(order_id) as orders_canceled,
       COUNT(order_id) FILTER (WHERE order_id IN (SELECT order_id
                                                  FROM courier_actions
                                                  WHERE action = 'deliver_order')) as orders_canceled_and_delivered
FROM user_actions
WHERE action = 'cancel_order'

<b>Задача 112</b>

По таблицам courier_actions и user_actions снова определите число недоставленных заказов и среди них посчитайте количество отменённых заказов и количество заказов, которые не были отменены (и соответственно, пока ещё не были доставлены).

Колонку с недоставленными заказами назовите orders_undelivered, колонку с отменёнными заказами назовите orders_canceled, колонку с заказами «в пути» назовите orders_in_process.

Поля в результирующей таблице: orders_undelivered, orders_canceled, orders_in_process

In [ ]:
from typing_extensions import Counter
SELECT COUNT(distinct order_id) as orders_undelivered,
       COUNT(order_id) FILTER (WHERE order_id IN (SELECT order_id
                                                  FROM user_actions
                                                  WHERE action = 'cancel_order')) as orders_canceled,
       COUNT(order_id) FILTER (WHERE order_id NOT IN (SELECT order_id
                               FROM user_actions
                               WHERE action = 'cancel_order')) as orders_in_process
FROM courier_actions
WHERE order_id NOT IN (SELECT order_id
                       FROM courier_actions
                       WHERE action = 'deliver_order')

<b>Задача 113</b>

Отберите из таблицы users пользователей мужского пола, которые старше всех пользователей женского пола.

Выведите две колонки: id пользователя и дату рождения. Результат отсортируйте по возрастанию id пользователя.

Поля в результирующей таблице: user_id, birth_date

In [ ]:
SELECT user_id,
       birth_date
FROM  users
WHERE sex = 'male'
and birth_date < (SELECT MIN(birth_date)
                  FROM users
                  WHERE sex = 'female')
ORDER BY user_id

<b>Задача 114</b>

Рассчитайте средний размер заказов, отменённых пользователями мужского пола.

Средний размер заказа округлите до трёх знаков после запятой. Колонку со значением назовите avg_order_size.

Поле в результирующей таблице: avg_order_size

In [ ]:
SELECT ROUND(AVG(array_length(product_ids, 1)), 3) as avg_order_size
FROM orders
WHERE order_id IN (SELECT order_id
                    FROM user_actions
                    WHERE action = 'cancel_order'
                    AND user_id IN (SELECT user_id
                                    FROM users
                                    WHERE sex = 'male'))

<b>Задача 115</b>

Для каждого заказа, в котором больше 5 товаров, рассчитайте время, затраченное на его доставку.

В результат включите id заказа, время принятия заказа курьером, время доставки заказа и время, затраченное на доставку. Новые колонки назовите соответственно time_accepted, time_delivered и delivery_time.

В расчётах учитывайте только неотменённые заказы. Время, затраченное на доставку, выразите в минутах, округлив значения до целого числа. Результат отсортируйте по возрастанию id заказа.

Поля в результирующей таблице: order_id, time_accepted, time_delivered и delivery_time

In [ ]:
SELECT DISTINCT order_id,
                MIN(time) as time_accepted,
                MIN(time) as time_delivered,
                (extract(epoch FROM (MAX(time) - MIN(time)))/60)::int as delivery_time
FROM courier_actions
WHERE order_id IN (SELECT order_id
                    FROM orders
                    WHERE array_length(product_ids, 1) > 5)
AND order_id NOT IN (SELECT order_id
                     FROM user_actions
                     WHERE action = 'cancel_order')
GROUP BY order_id
ORDER BY order_id

<b>Задача 116</b>

Для каждой даты в таблице user_actions посчитайте количество первых заказов, совершённых пользователями.

Первыми заказами будем считать заказы, которые пользователи сделали в нашем сервисе впервые. В расчётах учитывайте только неотменённые заказы.

В результат включите две колонки: дату и количество первых заказов в эту дату. Колонку с датами назовите date, а колонку с первыми заказами — first_orders.

Результат отсортируйте по возрастанию даты.

Поля в результирующей таблице: date, first_orders

In [ ]:
with first_orders as(SELECT user_id,
                            MIN(time) as first_order_time
                     FROM user_actions
                     WHERE order_id NOT IN (SELECT order_id
                                             FROM user_actions
                                             WHERE action = 'cancel_order')
                                             GROUP BY user_id)

SELECT DATE_TRUNC('day', first_order_time)::date as date,
       COUNT(*) as first_orders
FROM first_orders
GROUP BY DATE_TRUNC('day', first_order_time)
ORDER BY DATE_TRUNC('day', first_order_time)